Дошкольное_учреждение83/src/InformationRegisters/РазделенныеРегламентныеЗадания/РазделенныеРегламентныеЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазделенныеРегламентныеЗадания</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИндивидуальнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/CommonModules/ДополнительныеОтчетыИОбработкиВМоделиСервиса/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ДополнительныеОтчетыИОбработкиВМоделиСервиса.
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Для выполнения регламентных заданий в модели сервиса.
// 
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание - регламентное задание по
//   по выполнению дополнительной обработки
//  Использование - Булево - Истина: задание включено, Ложь: выключено.
// 
Процедура УточнитьПараметрыЗаданияВОчереди(РегламентноеЗадание, Использование) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
		
	// Если включено разделение, необходимо заполнить регистр РазделенныеРегламентныеЗадания.
	ИдентификаторЗадания = РегламентноеЗадание.УникальныйИдентификатор;
	НаборЗаписей = РегистрыСведений.РазделенныеРегламентныеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(ИдентификаторЗадания);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.РегламентноеЗадание = ИдентификаторЗадания;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	Запись.Использование           = Использование;
	Запись.ИндивидуальнаяНастройка = Истина;
	
	НаборЗаписей.Записать();
	
	Отбор = Новый Структура("РегламентноеЗадание", ИдентификаторЗадания);
	Задание = ОчередьЗаданий.ПолучитьЗадание(Отбор);
	
	ПараметрыЗадания = Новый Структура("РегламентноеЗадание, Параметры, ИмяМетода, Использование, Ключ", 
		ИдентификаторЗадания, 
		РегламентноеЗадание.Параметры, 
		РегламентноеЗадание.Метаданные.ИмяМетода, 
		Использование, 
		РегламентноеЗадание.Ключ
	);
		
	Если Задание = Неопределено Тогда
		ОчередьЗаданий.ДобавитьЗадание(ПараметрыЗадания);
	Иначе
		ОчередьЗаданий.ИзменитьЗадание(Задание, ПараметрыЗадания);
	КонецЕсли;
	
КонецПроцедуры
